docs/pagoda.txt

<?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.webservices.services.adapter.datahub/"><soapenv:Header/><soapenv:Body><ws:putSalesOrderData><wmsSecurityInfo><username>FLUXBGY</username><password>8888</password></wmsSecurityInfo><soInfo><wmsResultInfo><resultInfo/><returnCode/><returnDesc/><returnFlag/></wmsResultInfo><wmsSOHeaders><WAREHOUSEID>01</WAREHOUSEID><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><ORDERTYPE>XXSC</ORDERTYPE><ORDERTIME>2020-09-30 20:39:19</ORDERTIME><REQUIREDDELIVERYTIME>2020-10-01 00:00:00</REQUIREDDELIVERYTIME><EXPECTEDSHIPMENTTIME1>2020-10-01 00:00:00</EXPECTEDSHIPMENTTIME1><CUSTOMERID>PAGODA</CUSTOMERID><SOREFERENCE1>BGYSDLR2020093000037749</SOREFERENCE1><CONSIGNEEID>0161</CONSIGNEEID><CONSIGNEENAME>深圳龙岗区满庭芳店</CONSIGNEENAME><c_Address1>龙岗区白鸽路满庭芳首层商铺130号</c_Address1><c_Contact>0755-89704593</c_Contact><SOREFERENCE4>CW</SOREFERENCE4><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>2732</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>107801</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>13.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>10220</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>109612</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>40.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>1825</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>113726</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>盒</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>2.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>7779</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>104791</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>23.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>10839</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>110622</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>个</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>189.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>4130</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>106312</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>20.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>6957</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>108482</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>40.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>2996</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>108781</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>70.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>19304</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>127023</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>盒</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>54.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>30714</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>116303</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>盒</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>10.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>25306</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>116302</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>10.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>8755</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>111042</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>27.500000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>10484</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>105902</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>54.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>4094</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>111182</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>13.200000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>1246</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>112292</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>个</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>44.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>1060</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>100522</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>18.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>2537</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>100076</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>条</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>10.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>2698</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>107101</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>5.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>10813</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>101351</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>7.500000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>16749</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>111622</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>个</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>27.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>21098</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>100723</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>18.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>4388</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>110011</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>33.600000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>1245</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>112291</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>个</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>66.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>5721</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>114081</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>盒</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>12.000000</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037749</USERDEFINE5><d_EDI_16>17938</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>110629</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>个</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>9</QTYORDERED_EACH></detailsItem><detailsItem><SALESORDERNO>BGYSDLR2020093000037749</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000037747</USERDEFINE5><d_EDI_16>3120</d_EDI_16><CUSTOMERID>PAGODA</CUSTOMERID><SKU>300589</SKU><LOTATT06>szpsk</LOTATT06><d_EDI_07>szpsk</d_EDI_07><UOM>EA</UOM><d_EDI_15>公斤</d_EDI_15><d_EDI_06></d_EDI_06><QTYORDERED_EACH>30.000000</QTYORDERED_EACH></detailsItem></wmsSOHeaders></soInfo><wmsParam><customerid>FLUXWS</customerid><messageid>106SO</messageid><stdno>106SO</stdno><warehouseid>WH01</warehouseid></wmsParam></ws:putSalesOrderData></soapenv:Body></soapenv:Envelope>
